Revit 2027 API
ColorFillScheme.CanRemoveEntry Method
 Checks whether entry can be removed from the scheme.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanRemoveEntry(
	ColorFillSchemeEntry entry
)
Public Function CanRemoveEntry (
	entry As ColorFillSchemeEntry
) As Boolean
public:
bool CanRemoveEntry(
	ColorFillSchemeEntry^ entry
)
member CanRemoveEntry :
        entry : ColorFillSchemeEntry -> bool
Parameters
entry ColorFillSchemeEntry
 The entry to remove.
Return Value
Boolean
 Returns true if entry can be removed from the scheme, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 An entry cannot be removed if it is in use or does not exist in the scheme.
See Also
Reference
ColorFillScheme Class
Autodesk.Revit.DB Namespace